taskt/Core/Automation/Commands/WebBrowserGroup/ISeleniumSearchWebElementParametersProperties.dot
digraph "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties" [ label="ISeleniumSearchWebElementParametersProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchMultiWebElementsParametersProperties" [ label="ISeleniumSearchMultiWebElementsParametersProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ISelectionMethodProperties" [ label="ISelectionMethodProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchMultiWebElementsParametersProperties";
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties" -> "taskt.Core.Automation.Commands.ISelectionMethodProperties";
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchMultiWebElementsParametersProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
