taskt/Core/Automation/Commands/WebBrowserGroup/ISeleniumSearchWebElementParametersProperties.puml
@startuml
package "taskt.Core.Automation.Commands.WebBrowserGroup"{
Interface "ISeleniumSearchWebElementParametersProperties" {
+{abstract} v_WebElementIndex : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands.WebBrowserGroup"{
Interface "ISeleniumSearchMultiWebElementsParametersProperties" {
+{abstract} v_SearchMethod : String <<get>> <<set>> <<abstract>> 
+{abstract} v_SearchParameter : String <<get>> <<set>> <<abstract>> 
+{abstract} v_WaitTimeForWebElement : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "ISelectionMethodProperties" {
+{abstract} v_SelectionMethod : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}


taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchMultiWebElementsParametersProperties <|-- taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties
taskt.Core.Automation.Commands.ISelectionMethodProperties <|-- taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties
taskt.Core.Automation.Commands.IExpandableProperties <|-- taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchWebElementParametersProperties
taskt.Core.Automation.Commands.IExpandableProperties <|-- taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumSearchMultiWebElementsParametersProperties
@enduml
